miniwinwm/miniwinwm/e2studio/MiniWinFile/RX65N/src/smc_gen/r_usb_basic/src/driver/r_usb_cstd_rtos.c
    ret = xTaskCreate((TaskFunction_t)usb_hhub_task,        /** Entry function of USB HUB task  **/
                     "HUB_TSK",             /** Name of USB HUB task            **/
                     HUB_STACK_SIZE,        /** Stack size in words             **/
                     NULL,                  /** Task's parameter                **/
                     HUB_TSK_PRI,           /** Task's priority                 **/
                     &g_hub_tsk_hdl);       /** Task handler for use later      **/
    if (pdPASS != ret)
    {
        err = UsbRtos_Err_Init_Tsk;
        return err;
    }

    ret = xTaskCreate((TaskFunction_t)usb_hstd_mgr_task,    /** Entry function of USB MGR task  **/
                     "MGR_TSK",             /** Name of USB MGR task            **/
                     MGR_STACK_SIZE,        /** Stack size in words             **/
                     NULL,                  /** Task's parameter                **/
                     MGR_TSK_PRI,           /** Task's priority                 **/
                     &g_mgr_tsk_hdl);       /** Task handler for use later      **/
    if (pdPASS != ret)
    {
        err = UsbRtos_Err_Init_Tsk;
        return err;
    }

#endif /* ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST ) */
    
#if ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI )
    /** USB Tasks Creation **/
    ret = xTaskCreate((TaskFunction_t)usb_pstd_pcd_task,    /** Entry function of USB HCD task  **/
                     "PCD_TSK",             /** Name of USB HCD task            **/
                     PCD_STACK_SIZE,        /** Stack size in words             **/
                     NULL,                  /** Task's parameter                **/
                     PCD_TSK_PRI,           /** Task's priority                 **/
                     &g_pcd_tsk_hdl);       /** Task handler for use later      **/
    if (pdPASS != ret)
    {
        err = UsbRtos_Err_Init_Tsk;
        return err;
    }

    /** Create mailbox **/
    /** USB PCD task **/
    g_pcd_mbx_hdl = xQueueCreate(QUEUE_SIZE, sizeof(void *));
    if (NULL == g_pcd_mbx_hdl)
    {
        err = UsbRtos_Err_Init_Mbx;
        return err;
    }

#endif /* ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI ) */

#if defined(USB_CFG_PMSC_USE)
    /** USB Tasks Creation **/
    ret = xTaskCreate((TaskFunction_t)usb_pmsc_task,    /** Entry function of USB PMSC task  **/
                     "PMSC_TSK",            /** Name of USB HCD task            **/
                     PMSC_STACK_SIZE,       /** Stack size in words             **/
                     NULL,                  /** Task's parameter                **/
                     PMSC_TSK_PRI,          /** Task's priority                 **/
                     &g_pmsc_tsk_hdl);      /** Task handler for use later      **/
    if (pdPASS != ret)
    {
        err = UsbRtos_Err_Init_Tsk;
        return err;
    }

    /** Create mailbox **/
    /** USB PMSC task **/
    g_pmsc_mbx_hdl = xQueueCreate(QUEUE_SIZE, sizeof(void *));
    if (NULL == g_pmsc_mbx_hdl)
    {
        err = UsbRtos_Err_Init_Mbx;
        return err;
    }

#endif  /* defined(USB_CFG_PMSC_USE) */

    vSemaphoreCreateBinary(g_usb_semaphore_hdl[0]);
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
    vSemaphoreCreateBinary(g_usb_semaphore_hdl[1]);
#endif /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */

    return err;
} /* End of function usb_rtos_configuration() */

/******************************************************************************
 Function Name   : usb_cstd_rec_msg
 Description     : Receive a message to the specified id (mailbox).
 Argument        : uint8_t      id      : ID number (mailbox).
                 : usb_msg_t**  mess    : Message pointer
                 : usb_tm_t     tm      : Timeout Value
 Return          : uint16_t             : USB_OK / USB_ERROR
 ******************************************************************************/
usb_er_t usb_cstd_rec_msg (uint8_t id, usb_msg_t** mess, usb_tm_t tm)
{
    BaseType_t err;
    QueueHandle_t handle;

    (void *)tm;

    if (NULL == mess)
    {
        return USB_ERROR;
    }

    handle = (QueueHandle_t)( *(g_mbx_table[id]) );
    *mess  = NULL;

    /** Receive message from queue specified by *(mbx_table[id]) **/
    err = xQueueReceive(handle, (void *)mess, (TickType_t)(portMAX_DELAY));
    if ((pdTRUE == err) && (NULL != (*mess)))
    {
        return USB_OK;
    }
    else
    {
        return USB_ERROR;
    }
}
/******************************************************************************
 End of function usb_cstd_rec_msg
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_cstd_snd_msg
 Description     : Send a message to the specified id (mailbox).
 Argument        : uint8_t      id      : ID number (mailbox).
                 : usb_msg_t*   mess    : Message pointer
 Return          : usb_er_t             : USB_OK / USB_ERROR
 ******************************************************************************/
usb_er_t usb_cstd_snd_msg (uint8_t id, usb_msg_t* mess)
{
    BaseType_t err;
    QueueHandle_t handle;

    if (NULL == mess)
    {
        return USB_ERROR;
    }

    handle = (QueueHandle_t)( *(g_mbx_table[id]) );

    /** Send message to queue specified by *(mbx_table[id]) **/
    err = xQueueSend(handle, (const void *)&mess, (TickType_t)(0));
    if (pdTRUE == err)
    {
        return USB_OK;
    }
    else
    {
        return USB_ERROR;
    }
}
/******************************************************************************
 End of function usb_cstd_snd_msg
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_cstd_isnd_msg
 Description     : Send a message to the specified id (mailbox) while executing 
                 : an interrupt.
 Argument        : uint8_t      id      : ID number (mailbox).
                 : usb_msg_t*   mess    : Message pointer
 Return          : usb_er_t             : USB_OK / USB_ERROR
 ******************************************************************************/
usb_er_t usb_cstd_isnd_msg (uint8_t id, usb_msg_t* mess)
{
    BaseType_t err;
    QueueHandle_t handle;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;

    if (NULL == mess)
    {
        return USB_ERROR;
    }

